---
type: ReinforcementAbbreviationTag
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# ReinforcementAbbreviationTag

`Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReinforcementAbbreviationTag | 2016 | `public ReinforcementAbbreviationTag ( ReinforcementAbbreviationTagType typeTag , string abbreviationTag )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AbbreviationTag | 2016 | `public string AbbreviationTag { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TypeTag | 2016 | `public ReinforcementAbbreviationTagType TypeTag { get ; }` |